## Import libraries

In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

## Load dataset

In [6]:
data = pd.read_csv('insurance.csv')

In [8]:
data.head()

    age     sex     bmi  children smoker     region      charges
0  19.0  female  27.900       0.0    yes  southwest  16884.92400
1   NaN    male  33.770       1.0     no  southeast   1725.55230
2  28.0    male  33.000       3.0     no  southeast   4449.46200
3  33.0    male  22.705       0.0     no  northwest  21984.47061
4  32.0    male  28.880       0.0     no  northwest   3866.85520

In [10]:
data.shape

(1338, 7)

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1338 entries, 0 to 1337
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   age       1318 non-null   float64
 1   sex       1338 non-null   object
 2   bmi       1284 non-null   float64
 3   children  1205 non-null   float64
 4   smoker    1338 non-null   object
 5   region    1338 non-null   object
 6   charges   1338 non-null   float64
dtypes: float64(4), object(3)
memory usage: 73.3+ KB

## Access to rows and columns

In [15]:
data.iloc[0]

age              19.0
sex            female
bmi              27.9
children          0.0
smoker            yes
region      southwest
charges     16884.924
Name: 0, dtype: object

In [16]:
data.iloc[0][1]

'female'

In [17]:
data.iloc[0:3]

    age     sex    bmi  children smoker     region     charges
0  19.0  female  27.90       0.0    yes  southwest  16884.9240
1   NaN    male  33.77       1.0     no  southeast   1725.5523
2  28.0    male  33.00       3.0     no  southeast   4449.4620

In [21]:
data.iloc[0:3, 2:6]

     bmi  children smoker     region
0  27.90       0.0    yes  southwest
1  33.77       1.0     no  southeast
2  33.00       3.0     no  southeast

In [22]:
data.iloc[[2,5]]

    age     sex    bmi  children smoker     region    charges
2  28.0    male  33.00       3.0     no  southeast  4449.4620
5  31.0  female  25.74       0.0     no  southeast  3756.6216

In [29]:
data['age'][1:5]

1     NaN
2    28.0
3    33.0
4    32.0
Name: age, dtype: float64

In [32]:
data[['children', 'sex','region']][1:5]

   children   sex     region
1       1.0  male  southeast
2       3.0  male  southeast
3       0.0  male  northwest
4       0.0  male  northwest

In [34]:
data.region[1:5]

1    southeast
2    southeast
3    northwest
4    northwest
Name: region, dtype: object

## Categorical features

In [40]:
data[['sex', 'smoker', 'region']] = data[['sex', 'smoker', 'region']].astype('category')

In [41]:
data.dtypes

age          float64
sex         category
bmi          float64
children     float64
smoker      category
region      category
charges      float64
dtype: object